In [2]:
## Q1)
import pandas as pd
data=[4, 8, 15, 16, 23, 42]
data_series=pd.Series(data)
type(data_series)

pandas.core.series.Series

In [3]:
print(data_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
## Q2)
l=[]
for i in range(20,30):
    l.append(i)

In [5]:
l_series=pd.Series(l)

In [6]:
print(l_series)

0    20
1    21
2    22
3    23
4    24
5    25
6    26
7    27
8    28
9    29
dtype: int64

In [7]:
## Q3)
table={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
table_df=pd.DataFrame(table)

In [8]:
table_df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [10]:
## Q4) Pandas Dataframe is 2-Dimensional labelled data structure with different data types which makes it very easy to manipulate and process
#      the data. Pandas series on the otherhand is a 1-dimensional data structure with a common datatype.
#      In question 3, the table_df is a data frame but Name column is a series.
Name=table_df['Name']
print(type(Name))

<class 'pandas.core.series.Series'>

In [11]:
print(type(table_df))

<class 'pandas.core.frame.DataFrame'>

In [12]:
## Q5) The functions that we can use to manipulate the data are fillna(),dropna().
#      We use fillna() when we need to fill missing values in the dataset.

In [13]:
## Q6) Pandas series,dataframe and panel are all mutable in nature.

In [ ]:
## Q7)
# Creating three series  
names_series=pd.Series(['Ram','Varun','Riya','Karthik','Reshma'],name='Name')
grades_series=pd.Series([9.3,6.1,5.4,7.0,6.5],name='Grades')
roll_series=pd.Series([13,23,15,7,21],name='Roll Number')

In [ ]:
# Concating them to form the dataframe
info_df=pd.concat([name_series,grades_series,roll_series],axis=1)

In [ ]:
info_df.head()